Ran Plan for project: `production` dir: `prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].google_compute_global_address.public_address will be created
+ resource "google_compute_global_address" "public_address" {
+       address            = (known after apply)
+       creation_timestamp = (known after apply)
+       effective_labels   = {
+           "goog-terraform-provisioned" = "true"
        }
+       id                 = (known after apply)
+       label_fingerprint  = (known after apply)
+       name               = "prot-shiny-vm-broadinstitute-org-public-address"
+       prefix_length      = (known after apply)
+       project            = "broad-redirect-prod"
+       self_link          = (known after apply)
+       terraform_labels   = {
+           "goog-terraform-provisioned" = "true"
        }
    }

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].google_compute_global_forwarding_rule.global_forwarding_http_rule will be created
+ resource "google_compute_global_forwarding_rule" "global_forwarding_http_rule" {
+       base_forwarding_rule  = (known after apply)
+       effective_labels      = (known after apply)
+       forwarding_rule_id    = (known after apply)
+       id                    = (known after apply)
+       ip_address            = (known after apply)
+       ip_protocol           = (known after apply)
+       label_fingerprint     = (known after apply)
+       load_balancing_scheme = "EXTERNAL"
+       name                  = "prot-shiny-vm-broadinstitute-org-global-forwarding-http-rule"
+       network               = (known after apply)
+       network_tier          = (known after apply)
+       port_range            = "3838"
+       project               = "broad-redirect-prod"
+       psc_connection_id     = (known after apply)
+       psc_connection_status = (known after apply)
+       self_link             = (known after apply)
+       subnetwork            = (known after apply)
+       target                = (known after apply)
+       terraform_labels      = (known after apply)

+       service_directory_registrations (known after apply)
    }

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].google_compute_global_forwarding_rule.global_forwarding_https_rule will be created
+ resource "google_compute_global_forwarding_rule" "global_forwarding_https_rule" {
+       base_forwarding_rule  = (known after apply)
+       effective_labels      = (known after apply)
+       forwarding_rule_id    = (known after apply)
+       id                    = (known after apply)
+       ip_address            = (known after apply)
+       ip_protocol           = (known after apply)
+       label_fingerprint     = (known after apply)
+       load_balancing_scheme = "EXTERNAL"
+       name                  = "prot-shiny-vm-broadinstitute-org-global-forwarding-https-rule"
+       network               = (known after apply)
+       network_tier          = (known after apply)
+       port_range            = "443"
+       project               = "broad-redirect-prod"
+       psc_connection_id     = (known after apply)
+       psc_connection_status = (known after apply)
+       self_link             = (known after apply)
+       subnetwork            = (known after apply)
+       target                = (known after apply)
+       terraform_labels      = (known after apply)

+       service_directory_registrations (known after apply)
    }

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].google_compute_target_http_proxy.http_proxy will be created
+ resource "google_compute_target_http_proxy" "http_proxy" {
+       creation_timestamp = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       name               = "prot-shiny-vm-broadinstitute-org-http-proxy"
+       project            = "broad-redirect-prod"
+       proxy_bind         = (known after apply)
+       proxy_id           = (known after apply)
+       self_link          = (known after apply)
+       url_map            = (known after apply)
    }

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].google_compute_target_https_proxy.https_proxy will be created
+ resource "google_compute_target_https_proxy" "https_proxy" {
+       certificate_map    = (known after apply)
+       creation_timestamp = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       name               = "prot-shiny-vm-broadinstitute-org-https-proxy"
+       project            = "broad-redirect-prod"
+       proxy_bind         = (known after apply)
+       proxy_id           = (known after apply)
+       quic_override      = "NONE"
+       self_link          = (known after apply)
+       ssl_policy         = "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/sslPolicies/redirects-tls-policy"
+       tls_early_data     = (known after apply)
+       url_map            = (known after apply)
    }

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].google_compute_url_map.http_to_https_redirect will be created
+ resource "google_compute_url_map" "http_to_https_redirect" {
+       creation_timestamp = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       map_id             = (known after apply)
+       name               = "prot-shiny-vm-broadinstitute-org-to-http-url-map"
+       project            = "broad-redirect-prod"
+       self_link          = (known after apply)

+       default_url_redirect {
+           https_redirect         = true
+           redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
+           strip_query            = false
        }
    }

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].google_compute_url_map.https_url_map will be created
+ resource "google_compute_url_map" "https_url_map" {
+       creation_timestamp = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       map_id             = (known after apply)
+       name               = "prot-shiny-vm-broadinstitute-org-https-url-map"
+       project            = "broad-redirect-prod"
+       self_link          = (known after apply)

+       default_url_redirect {
+           host_redirect          = "www.broadinstitute.org"
+           https_redirect         = false
+           path_redirect          = "/"
+           redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
+           strip_query            = false
        }

+       host_rule {
+           hosts        = [
+               "prot-shiny-vm.broadinstitute.org",
            ]
+           path_matcher = "allpaths"
            # (1 unchanged attribute hidden)
        }

+       path_matcher {
+           name = "allpaths"

+           default_url_redirect {
+               host_redirect          = "www.broadinstitute.org"
+               https_redirect         = false
+               path_redirect          = "/"
+               redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
+               strip_query            = false
            }

+           path_rule {
+               paths = [
+                   "/BKM120",
+                   "/BKM120/",
                ]

+               url_redirect {
+                   host_redirect          = "proteogenomics.shinyapps.io"
+                   https_redirect         = true
+                   path_redirect          = "/cptac-BKM120-viewer/"
+                   redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
+                   strip_query            = false
                }
            }
+           path_rule {
+               paths = [
+                   "BC2016",
+                   "BC2016/",
                ]

+               url_redirect {
+                   host_redirect          = "proteogenomics.shinyapps.io"
+                   https_redirect         = true
+                   path_redirect          = "/cptac-BRCA2016-viewer/"
+                   redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
+                   strip_query            = false
                }
            }
+           path_rule {
+               paths = [
+                   "/CPTAC-BRCA2020",
+                   "/CPTAC-BRCA2020/",
                ]

+               url_redirect {
+                   host_redirect          = "proteogenomics.shinyapps.io"
+                   https_redirect         = true
+                   path_redirect          = "/cptac-BRCA2020-viewer/"
+                   redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
+                   strip_query            = false
                }
            }
        }
    }

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["prot-shiny-vm.broadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for prot-shiny-vm.broadinstitute.org"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = (known after apply)
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/prot-shiny-vm-broadinstitute-org",
            ]
+           domains                    = [
+               "prot-shiny-vm.broadinstitute.org",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map.certificates will be created
+ resource "google_certificate_manager_certificate_map" "certificates" {
+       create_time      = (known after apply)
+       description      = "Certificate map for prot-shiny-vm-broadinstitute-org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       gclb_targets     = (known after apply)
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       name             = (known after apply)
+       project          = "broad-redirect-prod"
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["prot-shiny-vm.broadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for prot-shiny-vm.broadinstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "prot-shiny-vm.broadinstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = (known after apply)
+       name             = (known after apply)
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["prot-shiny-vm-broadinstitute-org"].module.certificates.random_id.cert_suffix will be created
+ resource "random_id" "cert_suffix" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fterraform-broad-redirect%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production
  ```
Plan: 11 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```